Tejaswini-KR/3-Phase-Smart-Meter/Source/rl78i1c/application/relay/r_load_ctrl.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products.
* No other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
* applicable laws, including copyright laws. 
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIESREGARDING THIS SOFTWARE, WHETHER EXPRESS, IMPLIED
* OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
* NON-INFRINGEMENT.  ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED.TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY
* LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE FOR ANY DIRECT,
* INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR
* ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability 
* of this software. By using this software, you agree to the additional terms and conditions found by accessing the 
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2013, 2016 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/

/***********************************************************************************************************************
* File Name    : r_load_ctrl.c
* Version      : v1.0.0
* Device(s)    : <'RL78/I1C'>
* Tool-Chain   : <'CCRL'>
* H/W Platform : <'RL78/I1C Energy Meter Platform'>
* Description  : Load switch control application for Smart Meter
************************************************************************************************************************
* History      : DD.MM.YYYY     Version     Description
*                20.03.2018     v.1.0.0     New creation
***********************************************************************************************************************/

/***********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
***********************************************************************************************************************/

/* Common */
#include "typedef.h"

/* Meter Application */
#include "em_measurement.h"
#include "relay.h"
#include "event.h"
#include "r_load_ctrl.h"
#include "storage.h"

/* Wrapper functions */
#include "wrp_app_ext.h"

/* Standard library */
#include <string.h>

/***********************************************************************************************************************
Macro definitions
***********************************************************************************************************************/
#define DO_R_DISCONNECT()             RELAY_Phase_R_SwitchOff()
#define DO_R_RECONNECT()              RELAY_Phase_R_SwitchOn()
#define DO_Y_DISCONNECT()             RELAY_Phase_Y_SwitchOff()
#define DO_Y_RECONNECT()              RELAY_Phase_Y_SwitchOn()
#define DO_B_DISCONNECT()             RELAY_Phase_B_SwitchOff()
#define DO_B_RECONNECT()              RELAY_Phase_B_SwitchOn()

#define COUNTER_ENABLED			(1)
#define COUNTER_DISABLED		(0)


#define DIRECTION_UP			(1)
#define DIRECTION_DOWN			(0)

/* Local management function request */
#define CHECK_MAX_CHANNEL_RET_ERROR(ch, max)        if (ch >= max) return LOADCTRL_RET_ERROR;
#define MODIFY_TYPE_STATE(state, channel)           {                                                           \
                                                        g_load_ctrl_local_state_info[##channel##]= state;       \
                                                    }

#define REMOTE_RECONNECT_DELAY_COUNT_x10ms          (3000)
#define RESET_REMOTE_RECONNECT_DELAY_COUNT()        { g_load_ctrl_info.remote_reconn_delay_count = REMOTE_RECONNECT_DELAY_COUNT_x10ms ; }
#define RESTART_REMOTE_RECONNECT_DELAY_COUNT()      { g_load_ctrl_info.remote_reconn_delay_count = 0 ; }
#define IS_REMOTE_RECONNECT_DELAY_COUNT_END()       ( g_load_ctrl_info.remote_reconn_delay_count >= REMOTE_RECONNECT_DELAY_COUNT_x10ms )


typedef enum tag_loadctrl_timer_counter_id_t
{
	COUNTER_ID_LOAD_CTRL,
	COUNTER_ID_LOCKOUT_PERIOD,
	COUNTER_ID_AUTO_RECONNECT_INTERVAL,
	COUNTER_ID_OVER_CURRENT
} loadctrl_timer_counter_id_t;

/***********************************************************************************************************************
Typedef definitions
***********************************************************************************************************************/
typedef struct tag_load_ctrl_info_t
{
    uint8_t local_state_change;
    uint8_t remote_state_change;
    uint8_t manual_state_change;
    ctrl_state_t remote_new_state;
    ctrl_state_t manual_new_state;
    uint16_t remote_reconn_delay_count;
} r_load_ctrl_info_t;


typedef struct tag_storage_info_t
{
    uint32_t    address;    /* Address of Config on EEPROM */
    uint16_t    length;     /* Length of Config on EEPROM  */
} relay_storage_info_t;

/***********************************************************************************************************************
Imported global variables and functions (from other files)
***********************************************************************************************************************/

/***********************************************************************************************************************
Exported global variables and functions (to be accessed by other files)
***********************************************************************************************************************/

/***********************************************************************************************************************
Private global variables and functions
***********************************************************************************************************************/

/* Private functions */
void r_load_ctrl_mode0_enter(void);
void R_LOAD_CTRL_UpdateLimiterThreshold(void);

/* Load Limit Function Status */
uint8_t 					g_load_ctrl_state = 2;
uint8_t 					g_load_ctrl_mode = 1;
uint8_t 					g_load_ctrl_relay_status;

/* Load limit value.in W */
limit_threshold_type_t		g_limiter_normal;
limit_threshold_type_t		g_limiter_emergency;

uint32_t 					g_limiter_min_over_threshold_duration;
uint32_t 					g_limiter_min_under_threshold_duration;

/* Flag for manual reconnect (press LCD scroll button and hold 2s */
uint8_t g_load_ctrl_manual_reconn_flag = FALSE;

/* LOAD SWITCH CONTROL */

