Tejaswini-KR/3-Phase-Smart-Meter/Source/rl78i1c/application/relay/r_load_ctrl.c
/* 
 * Local functions state
 * 		Signal 0: Event - Case Open
 * 		Signal 1: Event - Overload (Power > Threshold)
 * 		Signal 2: Event - Overcurrent (I > 105 Imax)
 */
ctrl_state_t 				            g_load_ctrl_local_state_info[R_LOAD_CONTROL_LOCAL_MAX_FUNCTIONS];
static r_load_ctrl_info_t 		        g_load_ctrl_info;

/* LOAD SWITCH CONTROL */
/* Local functions state */
ctrl_state_t 				            g_load_ctrl_local_state_info[R_LOAD_CONTROL_LOCAL_MAX_FUNCTIONS];
static r_load_ctrl_info_t 		        g_load_ctrl_info;

RelayProgessStatus_t 					g_ctrl_relay_progess;
RelayAutoDisconnectParameter_t 			g_ctrl_relay_params = 
{
	LOCK_OUT_TIME_DEFAULT, 	        /* uint16_t 	lockout_period; (second) */
	TIME_INTERVAL_DEFAULT, 	        /* uint8_t 		delay_interval; (second) */
	NO_OF_REPETITIONS_DEFAULT, 		/* uint8_t		retry_counter; */
};

/* Storage map */
const relay_storage_info_t g_storage_info_limiter_normal                        = {STORAGE_EEPROM_LOAD_CTRL_THRESHOLD_NORMAL_ADDR, sizeof(limit_threshold_type_t)};
const relay_storage_info_t g_storage_info_limiter_emergency                     = {STORAGE_EEPROM_LOAD_CTRL_THRESHOLD_EMERGENCY_ADDR, sizeof(limit_threshold_type_t)};
const relay_storage_info_t g_storage_info_limiter_min_over_threshold_duration   = {STORAGE_EEPROM_LOAD_CTRL_MIN_OVER_DURATION_ADDR, STORAGE_EEPROM_LOAD_CTRL_MIN_OVER_DURATION_SIZE};
const relay_storage_info_t g_storage_info_limiter_min_under_threshold_duration  = {STORAGE_EEPROM_LOAD_CTRL_MIN_UNDER_DURATION_ADDR, STORAGE_EEPROM_LOAD_CTRL_MIN_UNDER_DURATION_SIZE};
const relay_storage_info_t g_storage_info_ctrl_control_state                    = {STORAGE_EEPROM_LOAD_CTRL_STATE_ADDR, STORAGE_EEPROM_LOAD_CTRL_STATE_SIZE};
const relay_storage_info_t g_storage_info_ctrl_control_mode                     = {STORAGE_EEPROM_LOAD_CTRL_MODE_ADDR, STORAGE_EEPROM_LOAD_CTRL_MODE_SIZE};
const relay_storage_info_t g_storage_info_ctrl_relay_status                     = {STORAGE_EEPROM_LOAD_CTRL_RELAY_STATUS_ADDR, STORAGE_EEPROM_LOAD_CTRL_RELAY_STATUS_SIZE};
const relay_storage_info_t g_storage_info_ctrl_relay_progess                    = {STORAGE_EEPROM_LOAD_CTRL_RELAY_PROGRESS_STATUS_ADDR, STORAGE_EEPROM_LOAD_CTRL_RELAY_PROGRESS_STATUS_SIZE};

/* Default value */
const limit_threshold_type_t g_limiter_normal_default 			= (limit_threshold_type_t)LIMITER_THRESHOLD_NORMAL_DEFAULT;
const limit_threshold_type_t g_limiter_emergency_default 		= (limit_threshold_type_t)LIMITER_THRESHOLD_EMERGENCY_DEFAULT;
const uint32_t  g_limiter_duration_default 			            = LIMITER_DURATION_DEFAULT;
const uint8_t	g_load_ctrl_state_default	                    = LOADCTRL_STATE_DEFAULT;
const uint8_t	g_ctrl_mode_default					            = LOADCTRL_MODE_DEFAULT;


typedef struct tag_relay_timer_counter_t
{
	uint8_t		enable;
	uint32_t	value;
} r_relay_timer_counter_t;

/* 
 * RTC 0.5s interrupts Counter
 *    [0] 		: Limiter over/under threshold period
 *    [1] 		: Lock out period (30min = 1800s)
 */
#define COUNTER_NUMBER                 (3)
static r_relay_timer_counter_t relay_timer_counter[COUNTER_NUMBER];

/* TIMER COUNTER */

void timer_counter_descrease_each_sec(void);
/******************************************************************************
* Function Name : timer_counter_descrease_each_sec
* Interface     : void timer_counter_descrease_each_sec(void)
* Description   :
* Arguments     :
* Return Value  : void
******************************************************************************/
void timer_counter_descrease_each_sec(void)
{
    uint8_t counter_id;

    for (counter_id = 0; counter_id < COUNTER_NUMBER; counter_id++)
    {
        if ((relay_timer_counter[counter_id].enable == TRUE) && (relay_timer_counter[counter_id].value > 0))
        {
            relay_timer_counter[counter_id].value--;
        }
    }
}

/******************************************************************************
* Function Name : timer_counter_disable
* Interface     : void timer_counter_disable(uint8_t counter_id)
* Description   :
* Arguments     : uint8_t counter_id
* Return Value  : void
******************************************************************************/
void timer_counter_disable(uint8_t counter_id)
{
	if (counter_id < COUNTER_NUMBER)
	{
		relay_timer_counter[counter_id].enable = FALSE;
	}
}

/******************************************************************************
* Function Name : timer_counter_enable
* Interface     : void timer_counter_enable(uint8_t counter_id)
* Description   :
* Arguments     : uint8_t counter_id
* Return Value  : void
******************************************************************************/
void timer_counter_enable(uint8_t counter_id)
{
	if (counter_id < COUNTER_NUMBER)
	{
		relay_timer_counter[counter_id].enable = TRUE;
	}
}

/******************************************************************************
* Function Name : timer_counter_get_value
* Interface     : void timer_counter_get_value(uint8_t counter_id)
* Description   :
* Arguments     : uint8_t counter_id
* Return Value  : Current value of counter[counter_id] 
*                 (uint32_t)  
******************************************************************************/
uint32_t timer_counter_get_value(uint8_t counter_id)
{
	if (counter_id < COUNTER_NUMBER)
	{
		return relay_timer_counter[counter_id].value;
	}
	else 
	{
		return 0;
	}
}

/******************************************************************************
* Function Name : timer_counter_set_value
* Interface     : void timer_counter_set_value(uint8_t counter_id , uint32_t value)
* Description   :
* Arguments     : uint8_t counter_id , uint32_t value
* Return Value  : None
******************************************************************************/
void timer_counter_set_value(uint8_t counter_id , uint32_t value)
{
	if (counter_id < COUNTER_NUMBER)
	{
		if (relay_timer_counter[counter_id].enable == FALSE)
		{
			relay_timer_counter[counter_id].value = value;
			relay_timer_counter[counter_id].enable = TRUE;
		}
	}
}

