Tejaswini-KR/3-Phase-Smart-Meter/Source/rl78i1c/application/relay/r_load_ctrl.c
/******************************************************************************
* Function Name : timer_counter_start
* Interface     : void timer_counter_start(uint8_t counter_id , uint32_t value)
* Description   :
* Arguments     : uint8_t counter_id , uint32_t value
* Return Value  : None
******************************************************************************/
void timer_counter_start(uint8_t counter_id , uint32_t value)
{
	if (counter_id < COUNTER_NUMBER)
	{
		relay_timer_counter[counter_id].value = value;
		relay_timer_counter[counter_id].enable = TRUE;
	}
}


static uint8_t g_check_state_at_init_flag = FALSE;

/******************************************************************************
* Function Name : r_load_ctrl_local_mgmt_polling_processing
* Interface     : void r_load_ctrl_local_mgmt_polling_processing(void)
* Description   : Polling processing for local management function
* Arguments     : None
* Function Calls: TBD
* Return Value  : None
******************************************************************************/
void r_load_ctrl_local_mgmt_polling_processing(void)
{
    uint16_t i;
    uint16_t conn_count;
	static uint8_t mode0_locker = FALSE;

    /* State changes? */
    if ((g_load_ctrl_info.local_state_change == TRUE) || (g_check_state_at_init_flag == TRUE))
    {
        if (g_load_ctrl_mode == 0 && mode0_locker == FALSE)
        {
            r_load_ctrl_mode0_enter();
			mode0_locker = TRUE;
            return;
        }
		else
		{
		 	mode0_locker = FALSE;
		}
		
        /* Summarize the number of ready local functions */
        conn_count = 0;
        for (i = 0; i < R_LOAD_CONTROL_LOCAL_MAX_FUNCTIONS; i++)
        {
            if (g_load_ctrl_local_state_info[i] == CTRL_STATE_CONN) {
                conn_count++;
            }
        }

        /* Is all local function confirm to connect? */
        if (conn_count >= R_LOAD_CONTROL_LOCAL_MAX_FUNCTIONS) {
            /* All confirm to connect */
            if ((g_load_ctrl_mode == 5) || (g_load_ctrl_mode == 6) || (g_check_state_at_init_flag == TRUE))
            {
                if (g_load_ctrl_state == CTRL_STATE_READY) {
                    DO_R_RECONNECT();
                    DO_Y_RECONNECT();
                    DO_B_RECONNECT();
                    /* Change the state also */
                    R_LOAD_CTRL_SetState(CTRL_STATE_CONN);
                }
                g_check_state_at_init_flag = FALSE;
            }
        }
        else {
            /* Some not confirm to connect */
            if (g_load_ctrl_state == CTRL_STATE_CONN) {
                DO_R_DISCONNECT();
                DO_Y_DISCONNECT();
                DO_B_DISCONNECT();
                R_LOAD_CTRL_SetState(CTRL_STATE_READY);
            }
            /* No state setting, ready also has load disconnected */
        }

        /* Acknowledge */
        g_check_state_at_init_flag = FALSE;
        g_load_ctrl_info.local_state_change = FALSE;
    }
}

/******************************************************************************
* Function Name : r_load_ctrl_remote_polling_processing
* Interface     : void r_load_ctrl_remote_polling_processing(void)
* Description   : Polling processing for remote request
* Arguments     : None
* Function Calls: TBD
* Return Value  : None
******************************************************************************/
void r_load_ctrl_remote_polling_processing(void)
{
    /* State changes? */
    if (g_load_ctrl_info.remote_state_change == TRUE)
    {
        if  (g_load_ctrl_info.remote_new_state == CTRL_STATE_CONN) {
            DO_R_RECONNECT();
            DO_Y_RECONNECT();
            DO_B_RECONNECT();
            R_LOAD_CTRL_SetState(g_load_ctrl_info.remote_new_state);
        }
        else {
            DO_R_DISCONNECT();
            DO_Y_DISCONNECT();
            DO_B_DISCONNECT();
            R_LOAD_CTRL_SetState(g_load_ctrl_info.remote_new_state);
        }

        /* Only remote reconnect has delay count */
        RESTART_REMOTE_RECONNECT_DELAY_COUNT();

        /* Acknowledge */
        g_load_ctrl_info.remote_state_change = FALSE;
    }
}

/******************************************************************************
* Function Name : r_load_ctrl_manual_polling_processing
* Interface     : void r_load_ctrl_manual_polling_processing(void)
* Description   : Polling processing for manual request
* Arguments     : None
* Function Calls: TBD
* Return Value  : None
******************************************************************************/
void r_load_ctrl_manual_polling_processing(void) 
{
    /* State changes? */
    if (g_load_ctrl_info.manual_state_change == TRUE)
    {
        if (g_load_ctrl_info.manual_new_state == CTRL_STATE_CONN) {
            DO_R_RECONNECT();
            DO_Y_RECONNECT();
            DO_B_RECONNECT();
            R_LOAD_CTRL_SetState(g_load_ctrl_info.manual_new_state);
        }
        else {
            DO_R_DISCONNECT();
            DO_Y_DISCONNECT();
            DO_B_DISCONNECT();
            R_LOAD_CTRL_SetState(g_load_ctrl_info.manual_new_state);
        }

        /* Recheck immediately */
        RESET_REMOTE_RECONNECT_DELAY_COUNT();

        /* Acknowledge */
        g_load_ctrl_info.manual_state_change = FALSE;
    }
}

/******************************************************************************
* Function Name : R_LOAD_CTRL_GetOutputState
* Interface     : uint8_t R_LOAD_CTRL_GetOutputState(
*               :     void
*               : );
* Description   : 
* Arguments     : 
* Function Calls: 
* Return Value  : Current status of relay:
*                   1: RELAY_CONNECTED
*                   0: RELAY_DISCONNECTED
******************************************************************************/
uint8_t R_LOAD_CTRL_GetOutputState(void)
{
    return RELAY_GetStatus();
}

/******************************************************************************
* Function Name : R_LOAD_CTRL_RemoteDisc
* Interface     : void R_LOAD_CTRL_RemoteDisc(
*               :     void
*               : );
* Description   : Remote disconnect. Remotely, via a communication channel;
* Arguments     :
* Function Calls:
* Return Value  : 0 is OK
******************************************************************************/
uint8_t R_LOAD_CTRL_RemoteDisc(void)
{
    /* Mode checking */
    if (g_load_ctrl_mode == 0)
    {
        r_load_ctrl_mode0_enter();
    }
    else
    {
        DO_R_DISCONNECT();
        DO_Y_DISCONNECT();
        DO_B_DISCONNECT();
        R_LOAD_CTRL_SetState(CTRL_STATE_DISC);
    }

    /* Return OK */
    return LOADCTRL_RET_OK;
}

