Tejaswini-KR/3-Phase-Smart-Meter/Source/rl78i1c/application/relay/r_load_ctrl.c
/******************************************************************************
* Function Name : R_LOAD_CTRL_RemoteReconn
* Interface     : void R_LOAD_CTRL_RemoteReconn(
*               :     void
*               : );
* Description   : Remote reconnect. Remotely, via a communication channel;
* Arguments     : 
* Function Calls: 
* Return Value  : 0 is OK
******************************************************************************/
uint8_t R_LOAD_CTRL_RemoteReconn(void)
{
	uint8_t return_code = LOADCTRL_RET_OK;
    
    /* Mode checking */
    if (g_load_ctrl_mode == 0)
    {
        r_load_ctrl_mode0_enter();
    }
    else if (g_load_ctrl_state != CTRL_STATE_DISC)
    {
        /* Not allow remote reconnect if previous state is not DISC */
        return_code = LOADCTRL_RET_ERROR;
    }
    else
    {
        switch ( g_load_ctrl_mode )
        {
            case 1:
            case 3:
            case 5:
            case 6:
                g_load_ctrl_info.remote_state_change = TRUE;
                g_load_ctrl_info.remote_new_state = CTRL_STATE_READY;
                break;
            case 2:
            case 4:
                g_load_ctrl_info.remote_state_change = TRUE;
                g_load_ctrl_info.remote_new_state = CTRL_STATE_CONN;
                break;
            default:
                break;
        }
        r_load_ctrl_remote_polling_processing();
    }

    /* Return OK */
    return LOADCTRL_RET_OK;
}


/******************************************************************************
* Function Name : R_LOAD_CTRL_LocalDisconn
* Interface     : uint8_t R_LOAD_CTRL_LocalDisconn(
*               :     void
*               : );
* Description   : Locally, by a function of the meter, e.g. limiter, prepayment 
* Arguments     : 
* Function Calls: 
* Return Value  : 0 is OK
******************************************************************************/
uint8_t R_LOAD_CTRL_LocalDisconn (void)
{
    /* This API is deprecated: for backward compatibility only
    * Calling this API will transfer signal directly to local channel 0
    */
    return R_LOADCTRL_LocalMgmt_Disconn(0);
}

/******************************************************************************
* Function Name : R_LOAD_CTRL_LocalReconn
* Interface     : uint8_t R_LOAD_CTRL_LocalReconn(
*               :     void
*               : );
* Description   : Locally, by a function of the meter, e.g. limiter, prepayment 
* Arguments     :
* Function Calls: 
* Return Value  : 0 is OK
******************************************************************************/
uint8_t R_LOAD_CTRL_LocalReconn (void)
{
    /* This API is deprecated: for backward compatibility only
    * Calling this API will transfer signal directly to local channel 0
    */
    return R_LOADCTRL_LocalMgmt_Reconn(0);
}

/******************************************************************************
* Function Name : R_LOADCTRL_LocalMgmt_Disconn
* Interface     : uint8_t R_LOADCTRL_LocalMgmt_Disconn(uint8_t local_func_index)
* Description   : Local function management disconnection request
* Arguments     : uint8_t local_func_index: index of local function
* Function Calls: TBD
* Return Value  : 0 is OK
******************************************************************************/
uint8_t R_LOADCTRL_LocalMgmt_Disconn(uint8_t local_func_index)
{
    uint8_t return_code = LOADCTRL_RET_OK;

    /* Check max supported index */
    CHECK_MAX_CHANNEL_RET_ERROR(local_func_index, R_LOAD_CONTROL_LOCAL_MAX_FUNCTIONS);
    /* Raise request */
    MODIFY_TYPE_STATE(CTRL_STATE_DISC, local_func_index);
    g_load_ctrl_info.local_state_change = TRUE;

    return return_code;
}

/******************************************************************************
* Function Name : R_LOADCTRL_LocalMgmt_Reconn
* Interface     : uint8_t R_LOADCTRL_LocalMgmt_Reconn(uint8_t local_func_index)
* Description   : Local function management reconnection request
* Arguments     : uint8_t local_func_index: index of local function
* Function Calls: TBD
* Return Value  : 0 is OK
******************************************************************************/
uint8_t R_LOADCTRL_LocalMgmt_Reconn(uint8_t local_func_index)
{
    uint8_t return_code = LOADCTRL_RET_OK;

    /* Check max supported index */
    CHECK_MAX_CHANNEL_RET_ERROR(local_func_index, R_LOAD_CONTROL_LOCAL_MAX_FUNCTIONS);
    /* Raise request */
    MODIFY_TYPE_STATE(CTRL_STATE_CONN, local_func_index);
    g_load_ctrl_info.local_state_change = TRUE;

    return return_code;
}

/******************************************************************************
* Function Name : R_LOAD_CTRL_ManDisconn
* Interface     : uint8_t R_LOAD_CTRL_ManDisconn(
*               :     void
*               : );
* Description   : Manual_disconnect. Manually, using e.g. a push button.
* Arguments     : 
* Function Calls: 
* Return Value  : 0 is OK
******************************************************************************/
uint8_t R_LOAD_CTRL_ManDisconn (void)
{
    uint8_t return_code = LOADCTRL_RET_OK;
    /* Mode checking */
    if (g_load_ctrl_mode == 0)
    {
        r_load_ctrl_mode0_enter();
    }
    else
    {
        // USER CODE
        if ((g_load_ctrl_mode == 1) || (g_load_ctrl_mode == 2) || (g_load_ctrl_mode == 5))
        {
            g_load_ctrl_info.manual_new_state = CTRL_STATE_READY;
            g_load_ctrl_info.manual_state_change = TRUE;
        }
        else {
            return_code = LOADCTRL_RET_ERROR;
        }
    }
    return return_code;
}

/******************************************************************************
* Function Name : R_LOAD_CTRL_ManReconn
* Interface     : uint8_t R_LOAD_CTRL_ManReconn(
*               :     void
*               : );
* Description   : Manual_reconnect. Manually, using e.g. a push button.
*               : 
* Arguments     : 
* Function Calls: 
* Return Value  : 0 is OK
******************************************************************************/
uint8_t R_LOAD_CTRL_ManReconn (void)
{
    uint8_t return_code = LOADCTRL_RET_OK;
    /* Mode checking */
    if (g_load_ctrl_mode == 0)
    {
        r_load_ctrl_mode0_enter();
    }
    else
    {
        if (g_load_ctrl_state == CTRL_STATE_READY) {
            g_load_ctrl_info.manual_new_state = CTRL_STATE_CONN;
            g_load_ctrl_info.manual_state_change = TRUE;
        }
        else {
            return_code = LOADCTRL_RET_ERROR;
        }
    }
    return 0;
}

