Tejaswini-KR/3-Phase-Smart-Meter/Source/rl78i1c/application/relay/r_load_ctrl.c
/******************************************************************************
* Function Name : R_LOAD_CTRL_SetMode
* Interface     : void R_LOAD_CTRL_SetMode(
*               :     uint8_t mode
*               : );
* Description   : 
* Arguments     : 
* Function Calls: 
* Return Value  : 
******************************************************************************/
uint8_t R_LOAD_CTRL_SetMode( uint8_t mode )
{
	uint8_t return_code = LOADCTRL_RET_OK;

    /* In Mode (0) the disconnect control object is always in [connected] state. */
    if (mode == 0)
    {
        r_load_ctrl_mode0_enter();
    }

    /* Update mode */
    g_load_ctrl_mode = mode;

    g_load_ctrl_info.local_state_change = TRUE;

    /* Write Control mode */
    EPR_Write(g_storage_info_ctrl_control_mode.address, (uint8_t *)&g_load_ctrl_mode, g_storage_info_ctrl_control_mode.length);
    /* Return OK */
	return return_code;
}

/******************************************************************************
* Function Name : r_load_ctrl_mode0_enter
* Interface     : void r_load_ctrl_mode0_enter(
*               :     void
*               : );
* Description   : 
* Arguments     : 
* Function Calls: 
* Return Value  : 
******************************************************************************/
void r_load_ctrl_mode0_enter (void)
{
    /* In Mode(0) the Ctrl obj is always in connnected state */
    DO_R_RECONNECT();
    DO_Y_RECONNECT();
    DO_B_RECONNECT();
    R_LOAD_CTRL_SetState(CTRL_STATE_CONN);
}


/******************************************************************************
* Function Name : R_LOAD_CTRL_SetState
* Interface     : void R_LOAD_CTRL_SetState(
*               :     uint8_t state
*               : );
* Description   : 
* Arguments     : 
* Function Calls: 
* Return Value  : 
******************************************************************************/
uint8_t R_LOAD_CTRL_SetState ( ctrl_state_t state )
{
    uint8_t return_code = LOADCTRL_RET_OK;

    g_load_ctrl_state = state;
    /* Write Control state */
    return EPR_Write(g_storage_info_ctrl_control_state.address, (uint8_t *)&g_load_ctrl_state, g_storage_info_ctrl_control_state.length);
}

/******************************************************************************
* Function Name : R_LOAD_CTRL_LocalControl_PollingProcessing
* Interface     : void R_LOAD_CTRL_LocalControl_PollingProcessing(
*               :     void
*               : );
* Description   : Do the following tasks
*               : + Check and activate Passive Relay Time profile
*               : + Local Auto reconnection
*               : + Local disconnection & Event handling
* Arguments     : <none>
* Return Value  : void
******************************************************************************/
void R_LOAD_CTRL_LocalControl_PollingProcessing(void)
{
	/* 
	 * Working mode:
	 *    0: Normal, 
	 *    1: Attempt at reconecting/Lockout
	 *    2: Reconnected
	 */

	/* Auto reconnection */
	{
		/* Mode switching  */
		{
			/* Relay output status = 1? */
			if (( g_load_ctrl_local_state_info[R_LOADCONTROL_LOCAL_SIGNAL_OVER_LOAD] != CTRL_STATE_CONN ||
				g_load_ctrl_local_state_info[R_LOADCONTROL_LOCAL_SIGNAL_OVER_CURRENT] != CTRL_STATE_CONN))
			{
				/* Trigger auto reconnect process */
				g_ctrl_relay_progess.mode = 1;
                if (g_ctrl_relay_progess.mode_old != g_ctrl_relay_progess.mode)
                {
    				if (g_ctrl_relay_progess.reconnection_count < g_ctrl_relay_params.retry_count)
    				{
    					g_ctrl_relay_progess.reconnection_count++;
    					timer_counter_start( 
    						COUNTER_ID_AUTO_RECONNECT_INTERVAL , 
    						g_ctrl_relay_params.delay_interval
    					);
    				}
    				else
    				{
    					/* Enter lockout period */
    					timer_counter_start( 
    						COUNTER_ID_AUTO_RECONNECT_INTERVAL , 
    						g_ctrl_relay_params.lockout_period
    					);
    					g_ctrl_relay_progess.reconnection_count = 0;
    				}
                }
			}
		}

		/* Mode processing */
		if (g_ctrl_relay_progess.mode == 0) /* Normal operation */
		{
			/* Waiting mode. Do nothing */
		}
		else if (g_ctrl_relay_progess.mode == 1)	/* Attempt at reconnecting */
		{
			/* Waiting interval period */
			if (timer_counter_get_value(COUNTER_ID_AUTO_RECONNECT_INTERVAL) == 0)
			{
				/* Auto re-connect */
				R_LOADCTRL_LocalMgmt_Reconn(R_LOADCONTROL_LOCAL_SIGNAL_OVER_LOAD);
				R_LOADCTRL_LocalMgmt_Reconn(R_LOADCONTROL_LOCAL_SIGNAL_OVER_CURRENT);
				g_ctrl_relay_progess.mode = 2;
			}
		}
		else if (g_ctrl_relay_progess.mode == 2)	/* Waiting for Load stabilization */
		{
			/* Start counter to check if load is stable. */
			if (g_load_ctrl_state == CTRL_STATE_CONN &&
				g_ctrl_relay_progess.signal_info.is_overload == FALSE &&
				g_ctrl_relay_progess.signal_info.is_over_current == FALSE)
			{
                g_ctrl_relay_progess.flag.IsEmergencyProfileActivated = FALSE;
				g_ctrl_relay_progess.reconnection_count = 0;
				g_ctrl_relay_progess.mode = 0;
			}
		}
	}

	/* Update threshold profile */
	if (g_ctrl_relay_progess.mode_old != g_ctrl_relay_progess.mode)
	{
		/* Update Overload threshold */
		R_LOAD_CTRL_UpdateLimiterThreshold();
		g_ctrl_relay_progess.mode_old = g_ctrl_relay_progess.mode;
	}
}



/******************************************************************************
* Function Name : R_LOAD_CTRL_Determine_OverCurrentEventStatus
* Interface     : uint8_t R_LOAD_CTRL_Determine_OverCurrentEventStatus(uint8_t state, uint8_t * p_is_occur)
* Description   :
* Arguments     :
*                   state       : INPUT
*                   p_is_occur  : OUTPUT
* Return Value  : uint8_t change
******************************************************************************/
uint8_t R_LOAD_CTRL_Determine_OverCurrentEventStatus(uint8_t state, uint8_t * p_is_occur)
{
	uint16_t interval_set;
    static uint8_t old_state = FALSE;
    uint8_t change = FALSE;

    uint32_t duration_occur = g_limiter_min_over_threshold_duration;
    uint32_t duration_restore = g_limiter_min_under_threshold_duration;

    if (state == TRUE)
    {   
        if (g_ctrl_relay_progess.signal_info.over_current_occur_count <= duration_occur)
        {
            g_ctrl_relay_progess.signal_info.over_current_occur_count++;
        }
        g_ctrl_relay_progess.signal_info.over_current_release_count = 0;
    }
    else
    {
        if (g_ctrl_relay_progess.signal_info.over_current_release_count <= duration_restore)
        {
            g_ctrl_relay_progess.signal_info.over_current_release_count++;
        }
        g_ctrl_relay_progess.signal_info.over_current_occur_count = 0;
    }

    /* Occurrence */
    if (g_ctrl_relay_progess.signal_info.over_current_occur_count > duration_occur)        
    {   
        R_LOADCTRL_LocalMgmt_Disconn(R_LOADCONTROL_LOCAL_SIGNAL_OVER_CURRENT);
        g_ctrl_relay_progess.flag.IsEmergencyProfileActivated = TRUE;

        if (g_ctrl_relay_progess.signal_info.is_over_current == FALSE)
        {
            g_ctrl_relay_progess.signal_info.is_over_current = TRUE;
            g_ctrl_relay_progess.signal_info.wait_over_current_restoration = TRUE;
            
            *p_is_occur = TRUE;
            change = TRUE;
        }
    }

    /* Restoration */
    if (g_ctrl_relay_progess.signal_info.over_current_release_count > duration_restore)
    {
        if (g_ctrl_relay_progess.signal_info.wait_over_current_restoration)
        {
            if (RELAY_GetStatus() == RELAY_DISCONNECTED)
            {
                /* Reset */
                g_ctrl_relay_progess.signal_info.over_current_release_count = 0;
            }
            else
            {
                g_ctrl_relay_progess.signal_info.is_over_current = FALSE;
                g_ctrl_relay_progess.signal_info.wait_over_current_restoration = FALSE;

                *p_is_occur = FALSE;
                change = TRUE;
            }
        }
    }

