Tejaswini-KR/3-Phase-Smart-Meter/Source/rl78i1c/application/relay/r_load_ctrl.c
    return change;
}

/******************************************************************************
* Function Name : R_LOAD_CTRL_Determine_OverLoadEventStatus
* Interface     : uint8_t R_LOAD_CTRL_Determine_OverLoadEventStatus(uint8_t state, uint8_t * p_is_occur)
* Description   :
* Arguments     :
*                   state       : INPUT
*                   p_is_occur  : OUTPUT
* Return Value  : uint8_t change
******************************************************************************/
uint8_t R_LOAD_CTRL_Determine_OverLoadEventStatus(uint8_t state, uint8_t * p_is_occur)
{
	uint16_t interval_set;
    static uint8_t old_state = FALSE;
    uint8_t change = FALSE;

    uint32_t duration_occur = g_limiter_min_over_threshold_duration;
    uint32_t duration_restore = g_limiter_min_under_threshold_duration;

    if (state == TRUE)
    {   
        if (g_ctrl_relay_progess.signal_info.overload_occur_count <= duration_occur)
        {
            g_ctrl_relay_progess.signal_info.overload_occur_count++;
        }
        g_ctrl_relay_progess.signal_info.overload_release_count = 0;
    }
    else
    {
        if (g_ctrl_relay_progess.signal_info.overload_release_count <= duration_restore)
        {
            g_ctrl_relay_progess.signal_info.overload_release_count++;
        }
        g_ctrl_relay_progess.signal_info.overload_occur_count = 0;
    }

    /* Occurrence */
    if (g_ctrl_relay_progess.signal_info.overload_occur_count > duration_occur)        
    {                      
        R_LOADCTRL_LocalMgmt_Disconn(R_LOADCONTROL_LOCAL_SIGNAL_OVER_LOAD);
        g_ctrl_relay_progess.flag.IsEmergencyProfileActivated = TRUE;

        if (g_ctrl_relay_progess.signal_info.is_overload == FALSE)
        {
            g_ctrl_relay_progess.signal_info.is_overload = TRUE;
            g_ctrl_relay_progess.signal_info.wait_over_load_restoration = TRUE;
            
            *p_is_occur = TRUE;
            change = TRUE;
        }
    }

    /* Restoration */
    if (g_ctrl_relay_progess.signal_info.overload_release_count > duration_restore)
    {
        if (g_ctrl_relay_progess.signal_info.wait_over_load_restoration)
        {
            if (RELAY_GetStatus() == RELAY_DISCONNECTED)
            {
                /* Reset */
                g_ctrl_relay_progess.signal_info.overload_release_count = 0;
            }
            else
            {
                g_ctrl_relay_progess.signal_info.is_overload = FALSE;
                g_ctrl_relay_progess.signal_info.wait_over_load_restoration = FALSE;

                *p_is_occur = FALSE;
                change = TRUE;
            }
        }
    }

    return change;
}

/******************************************************************************
* Function Name : R_LOAD_CTRL_ActivateEmergencyProfile
* Interface     : void R_LOAD_CTRL_ActivateEmergencyProfile(void)
* Description   :
* Arguments     :
* Return Value  : void
******************************************************************************/
void R_LOAD_CTRL_ActivateEmergencyProfile(void)
{
    g_ctrl_relay_progess.flag.IsEmergencyProfileActivated = TRUE;
}

void R_LOAD_CTRL_ActivateNormalProfile(void);
/******************************************************************************
* Function Name : R_LOAD_CTRL_ActivateNormalProfile
* Interface     : void R_LOAD_CTRL_ActivateNormalProfile(void)
* Description   :
* Arguments     :
* Return Value  : void
******************************************************************************/
void R_LOAD_CTRL_ActivateNormalProfile(void)
{
    g_ctrl_relay_progess.flag.IsEmergencyProfileActivated = FALSE;
}

/******************************************************************************
* Function Name : R_LOAD_CTRL_UpdateLimiterThreshold
* Interface     : void R_LOAD_CTRL_UpdateLimiterThreshold(
*               :     void
*               : );
* Description   :
* Arguments     :
* Return Value  : void
******************************************************************************/
void R_LOAD_CTRL_UpdateLimiterThreshold(void)
{
	if (g_ctrl_relay_progess.flag.IsEmergencyProfileActivated == FALSE)
	{
#if (defined( R_LOAD_LIMIT_DATA_TYPE ) && R_LOAD_LIMIT_DATA_TYPE == 0)
		EVENT_SetOverLoadThreshold(g_limiter_normal * 1000.0f);		/* Threshold is Unsigned Integer (kW) */
#else
		EVENT_SetOverLoadThreshold(g_limiter_normal);				/* Threshold is Float (W) */
#endif
	}
	else
	{
#if (defined( R_LOAD_LIMIT_DATA_TYPE ) && R_LOAD_LIMIT_DATA_TYPE == 0)
		EVENT_SetOverLoadThreshold(g_limiter_emergency * 1000.0f);	/* Threshold is Unsigned Integer (kW) */
#else
		EVENT_SetOverLoadThreshold(g_limiter_emergency);				/* Threshold is Float (W) */
#endif
	}
}

/******************************************************************************
* Function Name : R_LOAD_CTRL_Init
* Interface     : void R_LOAD_CTRL_Init(
*               :     void
*               : );
* Description   : 
* Arguments     : 
* Function Calls: 
* Return Value  : 
******************************************************************************/
void R_LOAD_CTRL_Init ( void )
{
    memset(&g_load_ctrl_local_state_info[0], CTRL_STATE_CONN, sizeof(g_load_ctrl_local_state_info));

    /* Trigger to rescan local state after initialization */
    g_check_state_at_init_flag = TRUE;

    /* Recheck immediately */
    RESET_REMOTE_RECONNECT_DELAY_COUNT();
}

/******************************************************************************
* Function Name : R_LOAD_CTRL_PollingProcess
* Interface     : void R_LOAD_CTRL_PollingProcess(
*               :     void
*               : );
* Description   : 
* Arguments     : 
* Function Calls: 
* Return Value  : 
******************************************************************************/
void R_LOAD_CTRL_PollingProcess (void)
{
    uint8_t status = RELAY_GetStatus();
    uint8_t old_status = RELAY_GetPreviousStatus();

    if (gp_inst_DataPop != NULL)
    {
        timer_counter_descrease_each_sec();
    }

    /* Check RELAY & current (A) */
    if (status != old_status)
    {
        if (status == RELAY_CONNECTED)
        {
            g_event_flag.bits.relay_status_changed = TRUE;
        }
        else
        {
            g_event_flag.bits.relay_status_changed = TRUE;
        }
        RELAY_SetPreviousStatus(status);
    }

