Tejaswini-KR/3-Phase-Smart-Meter/Source/rl78i1c/application/relay/r_load_ctrl.c
    r_load_ctrl_local_mgmt_polling_processing();
    r_load_ctrl_remote_polling_processing();
    r_load_ctrl_manual_polling_processing();

    /* Explananation:
    * The below routine like a workaround for current implementation
    * On testing: after remote reconnect, currently it's expected to recovered by limiter
    * But in fact, limiter only has role to actuate the relay when over or under threshold
    * So if we scan the state directly, it will switch directly to connection state if all local function is ready
    * This small routine below will add a small 'remote reconnect delay time'
    *   + Each calling, it will delay a fix small amount of time until reaching the defined timing
    *   + To prevent halting other application, it will wait in 10ms period, so please be cautious about the uint16_t capacity
    */
    if (g_load_ctrl_info.remote_reconn_delay_count < REMOTE_RECONNECT_DELAY_COUNT_x10ms) {
        /* Wait only 10ms each to prevent stopping other  */
        WRP_EXT_HwDelay(10, NULL);
        g_load_ctrl_info.remote_reconn_delay_count++;
        /* Trigger to re-scan ready state */
        if (g_load_ctrl_info.remote_reconn_delay_count >= REMOTE_RECONNECT_DELAY_COUNT_x10ms)
        {
            g_load_ctrl_info.local_state_change = TRUE;
        }
    }

	R_LOAD_CTRL_LocalControl_PollingProcessing(); 

    /* Reconnect mannual */
    if (g_load_ctrl_manual_reconn_flag != FALSE)
    {
        /* LCD scroll button is pressed and held in 2 second
         * g_load_ctrl_manual_reconn_flag will be raised in RTC periodic
         */
        R_LOAD_CTRL_ManReconn();
        g_load_ctrl_manual_reconn_flag = FALSE;
    }
    else
    {

    }
}

/******************************************************************************
* Function Name : R_LIMITER_Set_NormalThreashold
* Interface     : uint8_t R_LIMITER_Set_NormalThreashold(
*               :     float32_t value
*               : );
* Description   :
* Arguments     :
* Function Calls:
* Return Value  :
******************************************************************************/
uint8_t R_LIMITER_Set_NormalThreashold ( float32_t value )
{
	g_limiter_normal = (limit_threshold_type_t)value;
	R_LOAD_CTRL_UpdateLimiterThreshold();
    /* Back up new Limiter normal */
    EPR_Write(g_storage_info_limiter_normal.address, (uint8_t *)&g_limiter_normal, g_storage_info_limiter_normal.length);
    return TRUE;
}

/******************************************************************************
* Function Name : R_LIMITER_Set_EmergencyThreashold
* Interface     : uint8_t R_LIMITER_Set_EmergencyThreashold(
*               :     float32_t value
*               : );
* Description   :
* Arguments     :
* Function Calls:
* Return Value  :
******************************************************************************/
uint8_t R_LIMITER_Set_EmergencyThreashold ( float32_t value )
{
	g_limiter_emergency = (limit_threshold_type_t)value;
	R_LOAD_CTRL_UpdateLimiterThreshold();
    /* Write new Limiter emergency */
    EPR_Write(g_storage_info_limiter_emergency.address, (uint8_t *)&g_limiter_emergency, g_storage_info_limiter_emergency.length);
    return TRUE;
}


/******************************************************************************
* Function Name : R_LIMITER_Init
* Interface     : void R_LIMITER_Init(
*               :     void
*               : );
* Description   : 
* Arguments     : 
* Function Calls: 
* Return Value  : 
******************************************************************************/
void R_LIMITER_Init(void)
{
	R_LOAD_CTRL_UpdateLimiterThreshold();
}

/******************************************************************************
* Function Name : R_LIMITER_Get_OverThresholdDuration
* Interface     : uint8_t R_LIMITER_Get_OverThresholdDuration(uint32_t *p_data)
* Description   :
* Arguments     :
* Return Value  : uint8_t
******************************************************************************/
uint8_t R_LIMITER_Get_OverThresholdDuration(uint32_t *const p_data)
{
    *p_data = g_limiter_min_over_threshold_duration;
    
    return TRUE;
}

/******************************************************************************
* Function Name : R_LIMITER_Set_OverThresholdDuration
* Interface     : uint8_t R_LIMITER_Set_OverThresholdDuration(uint32_t value_input)
* Description   :
* Arguments     :
* Return Value  : uint8_t
******************************************************************************/
uint8_t R_LIMITER_Set_OverThresholdDuration(uint32_t value_input)
{
    g_limiter_min_over_threshold_duration = value_input;
    g_event_persistent_time.overload_occur = (uint8_t)value_input;
    return TRUE;
}

/******************************************************************************
* Function Name : R_LIMITER_Get_UnderThresholdDuration
* Interface     : uint8_t R_LIMITER_Get_UnderThresholdDuration(uint32_t *p_data)
* Description   :
* Arguments     :
* Return Value  : uint8_t
******************************************************************************/
uint8_t R_LIMITER_Get_UnderThresholdDuration(uint32_t *const p_data)
{
    *p_data = g_limiter_min_under_threshold_duration;
    
    return TRUE;
}

/******************************************************************************
* Function Name : R_LIMITER_Set_UnderThresholdDuration
* Interface     : uint8_t R_LIMITER_Set_UnderThresholdDuration(uint32_t value_input)
* Description   :
* Arguments     :
* Return Value  : uint8_t
******************************************************************************/
uint8_t R_LIMITER_Set_UnderThresholdDuration(uint32_t value_input)
{
    g_limiter_min_under_threshold_duration = value_input;
    g_event_persistent_time.overload_restore = (uint8_t)value_input;
    return TRUE;
}


/******************************************************************************
* Function Name : R_LOAD_CTRL_Restore
* Interface     : uint8_t R_LOAD_CTRL_Restore(
*               :     void
*               : );
* Description   : This function load data from storage to RAM
* Arguments     : 
* Function Calls: 
* Return Value  : Return if storage action is success or not.
*                       STORAGE_OK (0)      : OK   
*                       other value         : NOT OK   
******************************************************************************/
uint8_t R_LOAD_CTRL_Restore(void)
{
    uint8_t storage_return_code = STORAGE_OK;
    uint8_t result_code = STORAGE_OK;

    /* Limiter normal */
    storage_return_code = EPR_Read(
        g_storage_info_limiter_normal.address, 
        (uint8_t *)&g_limiter_normal, 
        g_storage_info_limiter_normal.length
    );
    if (storage_return_code != STORAGE_OK)
    {
        result_code = storage_return_code;
    }

