Tejaswini-KR/3-Phase-Smart-Meter/Source/rl78i1c/application/relay/r_load_ctrl.c
    /* Limiter emergency */
    storage_return_code = EPR_Read(
        g_storage_info_limiter_emergency.address, 
        (uint8_t *)&g_limiter_emergency, 
        g_storage_info_limiter_emergency.length
    );
    if (storage_return_code != STORAGE_OK)
    {
        result_code = storage_return_code;
    }
    /* Limiter over duration(min) */
    storage_return_code = EPR_Read(
        g_storage_info_limiter_min_over_threshold_duration.address, 
        (uint8_t *)&g_limiter_min_over_threshold_duration, 
        g_storage_info_limiter_min_over_threshold_duration.length
    );
    if (storage_return_code != STORAGE_OK)
    {
        result_code = storage_return_code;
    }

    /* Limiter under duration(min) */
    storage_return_code = EPR_Read(
        g_storage_info_limiter_min_under_threshold_duration.address, 
        (uint8_t *)&g_limiter_min_under_threshold_duration, 
        g_storage_info_limiter_min_under_threshold_duration.length
    );
    if (storage_return_code != STORAGE_OK)
    {
        result_code = storage_return_code;
    }

    /* Control state */
    storage_return_code = EPR_Read(
        g_storage_info_ctrl_control_state.address, 
        (uint8_t *)&g_load_ctrl_state, 
        g_storage_info_ctrl_control_state.length
    );
    if (storage_return_code != STORAGE_OK)
    {
        result_code = storage_return_code;
    }

    /* Control mode */
    storage_return_code = EPR_Read(
        g_storage_info_ctrl_control_mode.address, 
        (uint8_t *)&g_load_ctrl_mode, 
        g_storage_info_ctrl_control_mode.length
    );
    if (storage_return_code != STORAGE_OK)
    {
        result_code = storage_return_code;
    }

    /* Control relay status */
    storage_return_code = EPR_Read(
        g_storage_info_ctrl_relay_status.address, 
        (uint8_t *)&g_load_ctrl_relay_status, 
        g_storage_info_ctrl_relay_status.length
    );
    if (storage_return_code != STORAGE_OK)
    {
        result_code = storage_return_code;
    }

    /* Relay progess status */
    storage_return_code = EPR_Read(
        g_storage_info_ctrl_relay_status.address, 
        (uint8_t *)&g_ctrl_relay_progess, 
        g_storage_info_ctrl_relay_status.length
    );
    if (storage_return_code != STORAGE_OK)
    {
        result_code = storage_return_code;
    }
    
    /* Validate restore data. Set default value for invalid value */
    if (g_limiter_normal == 0)
    {
        g_limiter_normal = LIMITER_THRESHOLD_NORMAL_DEFAULT;
    }
    if (g_limiter_emergency == 0)
    {
        g_limiter_emergency = LIMITER_THRESHOLD_NORMAL_DEFAULT;
    }
    if (g_limiter_min_over_threshold_duration == 0)
    {
        g_limiter_min_over_threshold_duration = LIMITER_DURATION_DEFAULT;
    }
    
    if (g_limiter_min_under_threshold_duration == 0)
    {
        g_limiter_min_under_threshold_duration = LIMITER_DURATION_DEFAULT;
    }

    if (result_code != STORAGE_OK)
    {
        return STORAGE_ERROR;
    }

    return STORAGE_OK;
}
/******************************************************************************
* Function Name : R_LOAD_CTRL_Backup
* Interface     : void R_LOAD_CTRL_Restore(
*               :     void
*               : );
* Description   : store data from RAM to storage
* Arguments     : 
* Function Calls: 
* Return Value  : Return if storage action is success or not.
*                       STORAGE_OK (0)      : OK   
*                       other value         : NOT OK   
******************************************************************************/
uint8_t R_LOAD_CTRL_Backup(void)
{
    uint8_t storage_return_code = STORAGE_OK;
    uint8_t result_code = STORAGE_OK;

    /* Control relay status */
    storage_return_code = EPR_Write(
        g_storage_info_ctrl_relay_status.address, 
        (uint8_t *)&g_load_ctrl_relay_status, 
        g_storage_info_ctrl_relay_status.length
    );
    if (storage_return_code != STORAGE_OK)
    {
        result_code = storage_return_code;
    }

    /* Relay progess status */
    storage_return_code = EPR_Write(
        g_storage_info_ctrl_relay_progess.address, 
        (uint8_t *)&g_ctrl_relay_progess, 
        g_storage_info_ctrl_relay_progess.length
    );
    if (storage_return_code != STORAGE_OK)
    {
        result_code = storage_return_code;
    }

    if (result_code != STORAGE_OK)
    {
        return STORAGE_ERROR;
    }

    return STORAGE_OK;
}

/******************************************************************************
* Function Name : R_LOAD_CTRL_Format
* Interface     : uint8_t R_LOAD_CTRL_Restore(
*               :     void
*               : );
* Description   : format data, write default data to storage.
* Arguments     : 
* Function Calls: 
* Return Value  : 
******************************************************************************/
uint8_t R_LOAD_CTRL_Format(void)
{
    uint8_t storage_return_code = STORAGE_OK;
    uint8_t result_code = STORAGE_OK;

    /* Limiter normal */
    storage_return_code = EPR_Write(
        g_storage_info_limiter_normal.address, 
        (uint8_t *)&g_limiter_normal_default, 
        g_storage_info_limiter_normal.length
    );
    if (storage_return_code != STORAGE_OK)
    {
        result_code = storage_return_code;
    }

    /* Limiter emergency */
    storage_return_code = EPR_Write(
        g_storage_info_limiter_emergency.address, 
        (uint8_t *)&g_limiter_emergency_default, 
        g_storage_info_limiter_emergency.length
    );
    if (storage_return_code != STORAGE_OK)
    {
        result_code = storage_return_code;
    }

    /* Limiter over duration(min) */
    storage_return_code = EPR_Write(
        g_storage_info_limiter_min_over_threshold_duration.address, 
        (uint8_t *)&g_limiter_duration_default, 
        g_storage_info_limiter_min_over_threshold_duration.length
    );
    if (storage_return_code != STORAGE_OK)
    {
        result_code = storage_return_code;
    }

    /* Limiter under duration(min) */
    storage_return_code = EPR_Write(
        g_storage_info_limiter_min_under_threshold_duration.address, 
        (uint8_t *)&g_limiter_duration_default, 
        g_storage_info_limiter_min_under_threshold_duration.length
    );
    if (storage_return_code != STORAGE_OK)
    {
        result_code = storage_return_code;
    }

    /* Control state */
    storage_return_code = EPR_Write(
        g_storage_info_ctrl_control_state.address, 
        (uint8_t *)&g_load_ctrl_state_default, 
        g_storage_info_ctrl_control_state.length
    );
    if (storage_return_code != STORAGE_OK)
    {
        result_code = storage_return_code;
    }
   
    /* Control mode */
    EPR_Write(
        g_storage_info_ctrl_control_mode.address, 
        (uint8_t *)&g_ctrl_mode_default, 
        g_storage_info_ctrl_control_mode.length
    );
    if (storage_return_code != STORAGE_OK)
    {
        result_code = storage_return_code;
    }

    if (result_code != STORAGE_OK)
    {
        return STORAGE_ERROR;
    }
    
    return STORAGE_OK;
}
